blog/2021/lc-101-symmetric-tree.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-06 Sun 19:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>LC101. 对称二叉树</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">LC101. 对称二叉树</h1>
</header><p>
今天思考 LeetCode 题目：对称二叉树<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>。
</p>

<div id="outline-container-org975d6e3" class="outline-2">
<h2 id="org975d6e3">题目描述</h2>
<div class="outline-text-2" id="text-org975d6e3">
<p>
给定一个二叉树，检查它是否是镜像对称的。
</p>

<p>
例如，二叉树 <code>[1, 2, 2, 3, 4, 4, 3]</code> 是对称的。
</p>

<div class="org-src-container">
<pre class="src src-text">    1
   / \
  2   2
 / \ / \
3  4 4  3
</pre>
</div>

<p>
下面这个 <code>[1, 2, 2, null, 3, null, 3]</code> 就不是：
</p>

<div class="org-src-container">
<pre class="src src-text">  1
 / \
2   2
 \   \
 3    3
</pre>
</div>

<p>
进阶：可以用递归和迭代两种方法解决这个问题吗？
</p>
</div>
</div>

<div id="outline-container-orgeeeb5c3" class="outline-2">
<h2 id="orgeeeb5c3">题解<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></h2>
<div class="outline-text-2" id="text-orgeeeb5c3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #7c7565;">/**</span>
<span style="color: #7c7565;"> * Definition for a binary tree node.</span>
<span style="color: #7c7565;"> * function TreeNode(val, left, right) {</span>
<span style="color: #7c7565;"> *     this.val = (val===undefined ? 0 : val)</span>
<span style="color: #7c7565;"> *     this.left = (left===undefined ? null : left)</span>
<span style="color: #7c7565;"> *     this.right = (right===undefined ? null : right)</span>
<span style="color: #7c7565;"> * }</span>
<span style="color: #7c7565;"> */</span>
<span style="color: #7c7565;">/**</span>
<span style="color: #7c7565;"> * @param {TreeNode} root</span>
<span style="color: #7c7565;"> * @return {boolean}</span>
<span style="color: #7c7565;"> */</span>
<span style="color: #91a0b3;">var</span> <span style="color: #aaca86;">isSymmetric</span> = <span style="color: #91a0b3;">function</span> (<span style="color: #aaca86;">root</span>) {
    <span style="color: #706565;">// </span><span style="color: #857575;">&#20351;&#29992;&#36882;&#24402;&#36941;&#21382;&#24038;&#21491;&#23376;&#26641; &#36882;&#24402;&#19977;&#37096;&#26354;</span>
    <span style="color: #706565;">// </span><span style="color: #857575;">1. &#30830;&#23450;&#36882;&#24402;&#30340;&#21442;&#25968; root.left root.right &#21644;&#36820;&#22238;&#20540; true false </span>
    <span style="color: #91a0b3;">const</span> <span style="color: #aaca86;">compareNode</span> = <span style="color: #91a0b3;">function</span> (<span style="color: #aaca86;">left</span>, <span style="color: #aaca86;">right</span>) {
        <span style="color: #706565;">// </span><span style="color: #857575;">2. &#30830;&#23450;&#32456;&#27490;&#26465;&#20214; &#31354;&#30340;&#24773;&#20917;</span>
        <span style="color: #91a0b3;">if</span> (left === <span style="color: #ab85a3;">null</span> &amp;&amp; right !== <span style="color: #ab85a3;">null</span> || left !== <span style="color: #ab85a3;">null</span> &amp;&amp; right === <span style="color: #ab85a3;">null</span>) {
            <span style="color: #91a0b3;">return</span> <span style="color: #ab85a3;">false</span>;
        } <span style="color: #91a0b3;">else</span> <span style="color: #91a0b3;">if</span> (left === <span style="color: #ab85a3;">null</span> &amp;&amp; right === <span style="color: #ab85a3;">null</span>) {
            <span style="color: #91a0b3;">return</span> <span style="color: #ab85a3;">true</span>;
        } <span style="color: #91a0b3;">else</span> <span style="color: #91a0b3;">if</span> (left.val !== right.val) {
            <span style="color: #91a0b3;">return</span> <span style="color: #ab85a3;">false</span>;
        }
        <span style="color: #706565;">// </span><span style="color: #857575;">3. &#30830;&#23450;&#21333;&#23618;&#36882;&#24402;&#36923;&#36753;</span>
        <span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">outSide</span> = compareNode(left.left, right.right);
        <span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">inSide</span> = compareNode(left.right, right.left);
        <span style="color: #91a0b3;">return</span> outSide &amp;&amp; inSide;
    }
    <span style="color: #91a0b3;">if</span> (root === <span style="color: #ab85a3;">null</span>) {
        <span style="color: #91a0b3;">return</span> <span style="color: #ab85a3;">true</span>;
    }
    <span style="color: #91a0b3;">return</span> compareNode(root.left, root.right);
};
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://leetcode-cn.com/problems/symmetric-tree/">https://leetcode-cn.com/problems/symmetric-tree/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://leetcode-cn.com/problems/symmetric-tree/solution/dai-ma-sui-xiang-lu-dai-ni-xue-tou-er-ch-hnjo/#:~:text=Right)%3B%0A%20%20%20%20%7D%0A%20%20%20%20return%20true%3B%0A%7D-,JavaScript,-%E9%80%92%E5%BD%92%E5%88%A4%E6%96%AD">https://leetcode-cn.com/problems/symmetric-tree/solution/dai-ma-sui-xiang-lu-dai-ni-xue-tou-er-ch-hnjo/#:~:text=Right)%3B%0A%20%20%20%20%7D%0A%20%20%20%20return%20true%3B%0A%7D-,JavaScript,-%E9%80%92%E5%BD%92%E5%88%A4%E6%96%AD</a></p></div></div>


</div>
</div></div>
</body>
</html>